// Lab_02.cpp
// < Косанюк Богдан >
// Лабораторна робота № 2.
// Лінійні програми.
// Варіант 11
#include <iostream> // директива препроцесора потрібна для роботи "cout" і "cin"
#include <cmath> // директива препроцесора потрібна для роботи "sin", tan", "atan", "pow"
using namespace std; // інструкція для використання std (cout, cin, endl)без префікса std::
int main() // заголовок головної функціх програми
{ // початок меж блоку коду
	double Pi = 4 * atan(1.); // число пі
	double a; // вхідний параметр
	double z1; // результат обчислення 1-го виразу
	double z2; // результат обчислення 2-го виразу
	double rad; // кут в радіанах
	cout << "a = "; cin >> a; // вказати значення "а" в градусах
	rad = a * Pi / 180.0; // перехід з градусів в радіани, тому що С++ читає значення "а" як радіани
	z1 = (1. - 2. * pow(sin(rad), 2)) / (1. + sin(2. * rad)); // формула для визначення "z1"
	z2 = (1. - tan(rad)) / (1. + tan(rad)); // формула для визначення "z2"
	cout << endl; // виведенння порожнього рядка
	cout << "z1 = " << z1 << endl; // виведення значення "z1"
	cout << "z2 = " << z2 << endl; // виведення значення "z2"
	cin.get(); // функція очікування натискання клавіші
	return 0; // завершення програми
} // кінець меж блоку коду
// коміт 1